app/views/class_rooms/index.html.erb

        <td><%= class_room.name %></td>
        <td><%= class_room.students.size %></td>
        <td><%= class_room.teachers.size %></td>
        <td><%= class_room.disciplines.size %></td>
---
SELECT COUNT(*) FROM "students" WHERE "students"."class_room_id" = $1  [["class_room_id", 1]]
SELECT COUNT(*) FROM "teachers" INNER JOIN "teacher_class_room_disciplines" ON "teachers"."id" = "teacher_class_room_disciplines"."teacher_id" WHERE "teacher_class_room_disciplines"."class_room_id" = $1  [["class_room_id", 1]]
SELECT COUNT(*) FROM "disciplines" INNER JOIN "teacher_class_room_disciplines" ON "disciplines"."id" = "teacher_class_room_disciplines"."discipline_id" WHERE "teacher_class_room_disciplines"."class_room_id" = $1  [["class_room_id", 1]]