app/views/pages/provider_reports.html.erb

SELECT "students".* FROM "students" WHERE "students"."class_room_id" IN ($1, $2)  [["class_room_id", 3], ["class_room_id", 4]]
---
                  </div>
                  <% class_room.students.each do |student| %>

SELECT "class_rooms".* FROM "class_rooms"
SELECT "teacher_class_room_disciplines".* FROM "teacher_class_room_disciplines" WHERE "teacher_class_room_disciplines"."class_room_id" IN ($1, $2)  [["class_room_id", 1], ["class_room_id", 2]]
SELECT "teachers".* FROM "teachers" INNER JOIN "teacher_class_room_disciplines" ON "teachers"."id" = "teacher_class_room_disciplines"."teacher_id" WHERE "teacher_class_room_disciplines"."discipline_id" = $1  [["discipline_id", 1]]
---
                  </div>
                  <% class_room.teacher_class_room_disciplines.each do |item_relation| %>

SELECT COUNT(*) FROM "teachers" INNER JOIN "teacher_class_room_disciplines" ON "teachers"."id" = "teacher_class_room_disciplines"."teacher_id" WHERE "teacher_class_room_disciplines"."class_room_id" = $1  [["class_room_id", 3]]
---
                      <div class="col s3">
                        <p>Disciplines: <%= class_room.teacher_class_room_disciplines.size %></p>

SELECT COUNT(*) FROM "teachers" INNER JOIN "teacher_class_room_disciplines" ON "teachers"."id" = "teacher_class_room_disciplines"."teacher_id" WHERE "teacher_class_room_disciplines"."class_room_id" = $1  [["class_room_id", 3]]
---
                      <div class="col s3">
                        <p>Teachers: <%= class_room.teachers.size %></p>