app/controllers/class_rooms_controller.rb

SELECT  "class_rooms".* FROM "class_rooms" ORDER BY "class_rooms"."id" DESC LIMIT $1  [["LIMIT", 1]]
---
  def index
    @class_rooms = ClassRoom.all

SELECT "teachers".* FROM "teachers"
SELECT "disciplines".* FROM "disciplines"
---
  def new
    @class_room = ClassRoom.new
    @teachers = Teacher.all
    @disciplines = Discipline.all

INSERT INTO "class_rooms" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "PRIMEIRA SERIE"], ["created_at", "2019-09-18 18:15:38.013378"], ["updated_at", "2019-09-18 18:15:38.013378"]]
---
  def create
    @class_room = ClassRoom.create(set_class_room_params)

DELETE FROM "class_rooms" WHERE "class_rooms"."id" = $1  [["id", 2]]
---
  def destroy
    if @class_room.destroy!

SELECT "teachers".* FROM "teachers"
SELECT "disciplines".* FROM "disciplines"
SELECT  "class_rooms".* FROM "class_rooms" WHERE "class_rooms"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def set_class_room
    @teachers = Teacher.all
    @disciplines = Discipline.all
    @class_room = ClassRoom.find(params[:id])