app/controllers/disciplines_controller.rb

  def index
    @disciplines = Discipline.all
---
SELECT "disciplines".* FROM "disciplines"

  def create
    @discipline = Discipline.create(discipline_params)
---
INSERT INTO "disciplines" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "HISTORIA"], ["created_at", "2019-09-19 13:44:26.184177"], ["updated_at", "2019-09-19 13:44:26.184177"]]

  def update
    if @discipline.update_attributes(discipline_params)
---
UPDATE "disciplines" SET "name" = $1, "updated_at" = $2 WHERE "disciplines"."id" = $3  [["name", "DANCA"], ["updated_at", "2019-09-18 23:19:27.799616"], ["id", 5]]

  def destroy
    if @discipline.destroy!
---
DELETE FROM "disciplines" WHERE "disciplines"."id" = $1  [["id", 5]]

  def set_discipline
    @discipline = Discipline.find(params[:id])
---
SELECT  "disciplines".* FROM "disciplines" WHERE "disciplines"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]