app/controllers/pages_controller.rb

SELECT "teachers".* FROM "teachers"
SELECT "class_rooms".* FROM "class_rooms"
SELECT "class_rooms".* FROM "class_rooms" WHERE "class_rooms"."id" IN ($1, $2)  [["id", 1], ["id", 2]]
SELECT "disciplines".* FROM "disciplines" WHERE "disciplines"."id" IN ($1, $2)  [["id", 1], ["id", 3]]
SELECT "students".* FROM "students" WHERE "students"."class_room_id" IN ($1, $2)  [["class_room_id", 3], ["class_room_id", 4]]
SELECT "teacher_class_room_disciplines".* FROM "teacher_class_room_disciplines" WHERE "teacher_class_room_disciplines"."class_room_id" IN ($1, $2)  [["class_room_id", 3], ["class_room_id", 4]]
---
  def provider_reports
    @teachers = Teacher.all
    @class_rooms = ClassRoom.all

    @report_records = ClassRoom.includes(:teacher_class_room_disciplines,
                                         :students)