app/controllers/students_controller.rb

  def new
    @class_rooms = ClassRoom.all
---
SELECT "class_rooms".* FROM "class_rooms"

  def create
    @student = Student.create(student_params)
---
INSERT INTO "students" ("name", "class_room_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "KATIUCIA"], ["class_room_id", 1], ["created_at", "2019-09-18 23:28:25.754640"], ["updated_at", "2019-09-18 23:28:25.754640"]]

  def destroy
    if @student.destroy!
---
DELETE FROM "students" WHERE "students"."id" = $1  [["id", 4]]