app/controllers/teachers_controller.rb

INSERT INTO "teachers" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "OSMAR"], ["created_at", "2019-09-19 13:44:05.565755"], ["updated_at", "2019-09-19 13:44:05.565755"]]
---
  def create
    @teacher = Teacher.create(teacher_params)

UPDATE "teachers" SET "name" = $1, "updated_at" = $2 WHERE "teachers"."id" = $3  [["name", "DENYS w"], ["updated_at", "2019-09-18 23:17:25.825661"], ["id", 2]]
---
  def update
    if @teacher.update_attributes(teacher_params)

DELETE FROM "teachers" WHERE "teachers"."id" = $1  [["id", 6]]
---
  def destroy
    if @teacher.destroy!